Repository: plrigaux/mathtrainer
Catalog: src/locale/messages.*.xlf
Languages: fr

source: Good
fr: Bien

# congratulationMsg2
source: You got ICU from a total of INTERPOLATION_1 questions.
fr: Tu as ICU sur un total de INTERPOLATION_1 questions.

source: {VAR_PLURAL, plural, =0 {ZERO good answer} =1 {one good answer} other {INTERPOLATION good answers}}
fr: {VAR_PLURAL, plural, =0 {AUCUNE bonne réponse} =1 {une bonne réponse} other {INTERPOLATION bonnes réponses}}

# progressionMessage
source: of
fr: de

# startButton
source: Start
fr: Démarrer

source: Finished
fr: Terminé

# resultEquation
source: Equation
fr: Équation

# resultAnswer
source: Answer
fr: Réponse

# resultTime
source: Time
fr: Temps

# resultMistakes
source: Mistakes
fr: Erreurs

# startAgainButton
source: Start again
fr: Recommencer

# tabPrograms
source: Programs
fr: Programmes

# tabSeries
source: Series
fr: Séries

# customConfig
source: Custom configuration
fr: Configuration personnalisée

# Number 1
source: Numbers 1
fr: Nombre 1

# Field_required
source: Field is " dispEnd="</strong>">required
fr: Champ " dispEnd="</strong>">obligatoire

# Field_hint
source: Should be 2, or 1-3
fr: Doit être 2, ou 1-3

# Number 2
source: Numbers 2
fr: Nombre 2

source: Shuffle
fr: Mélanger

source: Subtraction
fr: Soustraction

source: Number of questions
fr: Nombre de questions

source: Math Worksheet
fr: Feuille d'exercices

# Workout
source: One by one
fr: Exercices

source: Clear all
fr: Effacer tout

source: Add Single Digit Number NoCarry
fr: Addition de deux nombres à un chiffre sans retenu

# addTowSingleDigitNumberSum10orLess
source: Adding two single-digit numbers - sum 10 or less
fr: Addition de deux nombres à un chiffre dont la sommes est de 10 ou moins

source: Add Single Digit Number
fr: Addition de deux nombres à un chiffre

# addDoubleDigitWithSingleDigitNumberNoCarry
source: Add a 2-digit number and a 1-digit number mentally - within the same ten
fr: Addition d'un nombre à deux chiffres avec un nombre à un chiffre - sans retenue

# addTowDoubleDigitNumbersNoCarry
source: Add a 2-digit number and a 1-digit number in columns
fr: Addition d'un nombre à deux chiffres avec un nombre à deux chiffres - sans retenue

# addTowDigitNumberWithTowDigitNumberWithCarry
source: Add a 2 digit number with a 2 digit number with carry
fr: Addition d'un nombre à deux chiffres avec un nombre à un chiffre - avec retenue

source: Add Two Numbers Answer Bellow 20
fr: Addition de deux nombre dont la réponse est en desous de 20

# subtractOneDigitNumberFromOneDigitNumberWithoutRegrouping
source: Subtraction facts - numbers up to 10
fr: Soustaction de nombres jusqu'à 10

# subtractAnswerbelow10
source: Subtraction facts - answer below 10
fr: Soustaction dont la réponse est en dessous de 10

# subtractOneDigitNumberFromTwoDigitNumberWithoutRegrouping
source: Subtract a one-digit number from a two-digit number - without regrouping
fr: Soustraction de nombre à un chiffre d'un nombre à deux chiffres - sans emprunt

source: Subtract multiples of 10
fr: Soustraction de multiples de 10

# subtractOneDigitNumberFromTwoDigitNumberWithRegrouping
source: Subtract a one-digit number from a two-digit number - with regrouping
fr: Soustraction de nombre à un chiffre d'un nombre à deux chiffres - avec emprunt

# subtractTowDigitNumberFromTwoDigitNumberWithoutRegrouping
source: Subtract two two-digit numbers - without regrouping
fr: Soustraction de deux nombres à deux chiffres - sans emprunt

# subtractTwoDigitNumberFromTwoDigitNumberWithRegrouping
source: Subtract two two-digit numbers - with regrouping
fr: Soustraction de deux nombres à deux chiffres - avec emprunt

# Multiply_2_single_digits
source: Multiply two single digit numbers
fr: Multiplication de deux nombres à un chiffre

# MultiplicationTable
source: PH time table
fr: Table de PH
